cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-bootloader/rc-car-peripheral-bootloader.cydsn/Generated_Source/PSoC5/TREG1.h
/*******************************************************************************
* File Name: TREG1.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_TREG1_H) /* CY_STATUS_REG_TREG1_H */
#define CY_STATUS_REG_TREG1_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} TREG1_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 TREG1_Read(void) ;
void TREG1_InterruptEnable(void) ;
void TREG1_InterruptDisable(void) ;
void TREG1_WriteMask(uint8 mask) ;
uint8 TREG1_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define TREG1_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define TREG1_INPUTS              8


/***************************************
*             Registers
***************************************/

/* Status Register */
#define TREG1_Status             (* (reg8 *) TREG1_sts_sts_reg__STATUS_REG )
#define TREG1_Status_PTR         (  (reg8 *) TREG1_sts_sts_reg__STATUS_REG )
#define TREG1_Status_Mask        (* (reg8 *) TREG1_sts_sts_reg__MASK_REG )
#define TREG1_Status_Aux_Ctrl    (* (reg8 *) TREG1_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_TREG1_H */


/* [] END OF FILE */
